Repository: abragad/wp-bsky-autoposter
Catalog: languages/*.po
Languages: it_it

source: WP AutoPoster to Bluesky
it_it: WP AutoPoster per Bluesky

source: Automatically posts new WordPress posts to Bluesky with rich link previews.
it_it: Pubblica automaticamente i nuovi post di WordPress su Bluesky con ricche anteprime dei link.

source: Authentication failed: %s
it_it: Autenticazione non riuscita: %s

source: Successfully authenticated with Bluesky as %s
it_it: Autenticato con successo con Bluesky come %s

source: Authentication failed: Invalid response from Bluesky API
it_it: Autenticazione fallita: risposta non valida dalla API Bluesky

source: Token refresh failed: %s
it_it: Aggiornamento del token fallito: %s

source: Successfully refreshed authentication token
it_it: Aggiornato con successo il token di autenticazione

source: Token refresh failed: Invalid response from Bluesky API
it_it: Fallito aggiornamento token: risposta non valida dalla API Bluesky

source: Failed to download image at %1$s: %2$s
it_it: Non è stato possibile scaricare l'immagine da %1$s: %2$s

source: Determined image type from extension: %s
it_it: Tipo di immagine determinato dall'estensione: %s

source: Could not determine image type from extension: %s
it_it: Impossibile determinare il tipo di immagine dall'estensione: %s

source: Invalid image type: %s
it_it: Tipo di immagine non valido: %s

source: Image too large (%1$.2f MB), attempting to compress... Original size: %2$d bytes
it_it: Immagine troppo grande (%1$.2f MB), tentativo di compressione... Dimensione originale: %2$d byte

source: Failed to create image resource for compression
it_it: Impossibile creare una risorsa immagine per la compressione

source: Original dimensions: %1$dx%2$d pixels (ratio: %3$.2f)
it_it: Dimensioni originali: %1$dx%2$d pixel (rapporto: %3$.2f)

source: New dimensions: %1$dx%2$d pixels (80%% of original)
it_it: Nuove dimensioni: %1$dx%2$d pixel (80%% dell'originale)

source: Preserving transparency for PNG image
it_it: Manteniamo la trasparenza dell’immagine PNG

source: Applied JPEG compression with 85% quality
it_it: Applicazione della compressione JPEG con una qualità dell'85%

source: Applied PNG compression with level 8
it_it: Applicazione della compressione PNG con livello 8

source: Applied WebP compression with 85% quality
it_it: Applicazione della compressione WebP con una qualità dell'85%

source: Compression results: %1$.2f MB -> %2$.2f MB (%3$.1f%% reduction)
it_it: Risultati della compressione: %1$.2f MB -> %2$.2f MB (riduzione del %3$.1f%%)

source: Image still too large after compression (%1$.2f MB > %2$.2f MB limit)
it_it: Immagine ancora troppo grande dopo la compressione (%1$.2f MB > limite %2$.2f MB)

source: Successfully compressed image to %1$.2f MB (%2$.1f%% of original size)
it_it: Immagine compressa con successo a %1$.2f MB (%2$.1f%% della dimensione originale)

source: Failed to upload image: %s
it_it: Non è stato possibile caricare l'immagine: %s

source: Posting article %1$d at %2$s
it_it: Articolo %1$d a %2$s in pubblicazione

source: Successfully uploaded image
it_it: Immagine caricata con successo

source: Attempting to post with data: %s
it_it: Tentativo di inviare i dati: %s

source: Failed to post article %1$d to Bluesky: %2$s
it_it: Impossibile inviare l'articolo %1$d a Bluesky: %2$s

source: Successfully posted article %1$d to Bluesky: %2$s
it_it: Pubblicato con successo l'articolo %1$d su Bluesky: %2$s

source: Received 5XX error (HTTP %1$d) on attempt %2$d/%3$d. Retrying in %4$d seconds...
it_it: Ricevuto errore 5XX (HTTP %1$d) al tentativo %2$d/%3$d. Riprova tra %4$d secondi...

source: Unknown error
it_it: Errore sconosciuto

source: Failed to post to Bluesky (HTTP %1$d): %2$s. Response: %3$s
it_it: Impossibile inviare a Bluesky (HTTP %1$d): %2$s. Risposta: %3$s

source: Failed to post to Bluesky after %d attempts with 5XX errors
it_it: Non è stato possibile inviare un messaggio a Bluesky dopo %d tentativi con 5XX errori

source: Bluesky AutoPoster Settings
it_it: Impostazioni Bluesky AutoPoster

source: Bluesky AutoPoster Logs
it_it: Log di Bluesky AutoPoster

source: Logs
it_it: Log

source: Settings
it_it: Impostazioni

source: Bluesky Account Settings
it_it: Impostazioni Account Bluesky

source: Link Tracking
it_it: Tracciamento dei collegamenti

source: Logging
it_it: Registrazione log

source: Bluesky Handle
it_it: Nome utente Bluesky

source: App Password
it_it: Password per app

source: Test Connection
it_it: Test della connessione

source: Post Template
it_it: Template Post

source: Fallback Text
it_it: Testo di riserva

source: Inline Hashtags
it_it: Hashtag in linea

source: Enable Link Tracking
it_it: Abilitare il tracciamento dei collegamenti

source: Log Level
it_it: Livello di dettaglio del log

source: Log File Location
it_it: Posizione del logfile

source: Custom Log Path
it_it: Posizione log personalizzata

source: Enter your Bluesky account details and customize how posts are formatted.
it_it: Inserite i dati del vostro account Bluesky e personalizzate la formattazione dei post.

source: Configure UTM parameters for link tracking. You can use {id} and {slug} placeholders in the values.
it_it: Configurare i parametri UTM per il tracciamento dei link. È possibile utilizzare i segnaposto {id} e {slug} nei valori.

source: Configure logging settings for the plugin.
it_it: Configura le impostazioni di log del plugin.

source: Enter your Bluesky handle (e.g., username.bsky.social) or DID. The @ symbol is optional.
it_it: Inserite il vostro nome utente Bluesky (ad esempio, username.bsky.social) o DID. Il simbolo @ è facoltativo.

source: Enter your Bluesky App Password. You can generate this in your Bluesky account settings.
it_it: Inserire la password per app di Bluesky. È possibile generarla nelle impostazioni dell'account Bluesky.

source: Test your Bluesky credentials before saving.
it_it: Test delle credenziali Bluesky prima di salvare.

source: Connection test failed. Please try again.
it_it: Test di connessione fallito. Riprovare.

source: Text to use when post excerpt is empty. Supports {title}, {link}, and {hashtags} placeholders.
it_it: Testo da utilizzare quando l'estratto del post è vuoto. Supporta i segnaposto {title}, {link} e {hashtags}.

source: Move matching hashtags into the main text (experimental). Only affects single-word hashtags that appear as whole words in the text.
it_it: Sposta gli hashtag corrispondenti nel testo principale (sperimentale). Ha effetto solo sugli hashtag a parola singola che appaiono come parole intere nel testo.

source: Enable UTM parameter tracking for links posted to Bluesky.
it_it: Abilitare il tracciamento dei parametri UTM per i link pubblicati su Bluesky.

source: Suggested: bsky
it_it: Consigliato: bsky

source: Suggested: social
it_it: Consigliato: social

source: Suggested: feed
it_it: Consigliato: feed

source: Optional. You can use {id} and {slug} placeholders.
it_it: Opzionale. È possibile utilizzare i segnaposto {id} e {slug}.

source: Error Only
it_it: Solo Errori

source: Warning and Above
it_it: Warning e livelli superiori

source: Success and Above
it_it: Completato con successo e livelli superiori

source: Debug (All Messages)
it_it: Debug (tutti i messaggi)

source: Choose the minimum level of messages to be logged. Messages below this level will not be written to the log file.
it_it: Scegliere il livello minimo di messaggi da registrare. I messaggi al di sotto di questo livello non verranno scritti nel file di log.

source: View Log File
it_it: Guarda i log

source: The log file is stored in your WordPress uploads directory.
it_it: Il file di log viene memorizzato nella directory uploads di WordPress.

source: Leave empty to use the default location in the WordPress uploads directory. The path must be writable by the web server.
it_it: Lasciare vuoto per utilizzare il percorso predefinito nella directory degli upload di WordPress. Il percorso deve essere scrivibile dal server web.

source: Invalid Bluesky handle format. Please enter a valid handle (e.g., username.bsky.social) or DID.
it_it: Formato dell'handle Bluesky non valido. Inserire un handle valido (ad esempio, username.bsky.social) o DID.

source: The specified log directory is not writable. Please choose a different location.
it_it: La directory dei log specificata non è scrivibile. Scegliere un'altra posizione.

source: Security check failed.
it_it: Controllo di sicurezza non riuscito.

source: You do not have permission to perform this action.
it_it: Non si dispone dell'autorizzazione per eseguire questa azione.

source: Please enter both Bluesky handle and app password.
it_it: Inserite il nome utente Bluesky e la password per app.

source: Connection successful! Authenticated as %s.
it_it: Connessione riuscita! Autenticato come %s.

source: Connection failed. Please check your credentials and try again.
it_it: Connessione fallita. Controllare le credenziali e riprovare.

source: Error reading log file.
it_it: Errore nella lettura del logfile.

source: Log file does not exist.
it_it: Il logfile non esiste.

source: Refresh
it_it: Aggiorna

source: Clear Logs
it_it: Azzera i log

source: Are you sure you want to clear all logs?
it_it: Sicuro di voler azzerare i log?

source: Failed to clear log file.
it_it: Errore nella cancellazione del logfile.

source: Logs cleared successfully.
it_it: Log azzerati con successo.
